<?PHP
    $regions = array(
        "Московская область" => array(
            "Москва",
            "Зеленоград",
            "Клин",
        ),
        "Ленинградская область" => array(
            "Санкт-Петербург", 
            "Всеволожск", 
            "Павловск", 
            "Кронштадт",
        ),
        "Рязанская область" => array(
            "Рязань",
           "Касимов",
           "Скопин",
           "Сасово",
           "Ряжск",
           "Новомичуринск",
           "Рыбное",
           "Кораблино",
           "Михайлов",
           "Спасск-Рязанский",
           "Шацк",
           "Спас-Клепики",
        ),
    );

    foreach($regions as $myValue){
        $comma_separated = implode(",", $myValue);
        echo $comma_separated;
    }
?>